app/Controllers/User.php

    public function index()
    {
        $model = new UserModel();
        $data['users'] = $model->paginate(10);
---
SELECT *
FROM "users"
 LIMIT 10
SELECT COUNT(*) AS "numrows"
FROM "users"

    public function store()
    {
        $model = new UserModel();

        if (!$this->validate($this->validationRules)) {
            // Validation failed, return with errors
            session()->setFlashdata('validation', $this->validator);
            session()->setFlashdata('old', $this->request->getPost());
            return redirect()->to('/user/create')->withInput();
        }

        $data = [
            'name' => $this->request->getPost('name'),
            'email' => $this->request->getPost('email'),
        ];
        $model->save($data);
---
INSERT INTO "users" ("name", "email") VALUES ('coba', 'c@mail.com')

    public function edit($id)
    {
        $model = new UserModel();
        $data['user'] = $model->find($id);
---
SELECT *
FROM "users"
WHERE "users"."id" = '3'

    public function delete($id)
    {
        $model = new UserModel();
        $model->delete($id);
---
DELETE FROM "users"
WHERE "id" IN ('3')